In [4]:
#creating dataframe
import pandas as pd
data = {
    "Tid": [1,2,3,4,5,6,7,8,9,10],
    "Refund": ["Yes","No","No","Yes","No","No","Yes","No","No","No"],
    "Marital Status": ["Single","Married","Single","Married","Divorced","Married","Divorced","Single","Married","Single"],
    "Taxable Income": ["125k","100k","70k","120k","95k","60k","220k","85k","75k","90k"],
    "Cheat": ["No","No","No","No","Yes","No","No","Yes","No","Yes"]  
}
df = pd.DataFrame(data)
selected_rows = df.loc[[0,4,7,8]]
selected_rows

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125k    No
4    5     No       Divorced            95k   Yes
7    8     No         Single            85k   Yes
8    9     No        Married            75k    No

In [2]:
#Reading csv file
import pandas as pd
df1 = pd.read_csv("tax.csv")
df1

   Tid Refund Marital Status  Taxable Income Cheat
0    1    Yes         Single          125000    No
1    2     No        Married          100000    No
2    3     No         Single           70000    No
3    4    Yes        Married          120000    No
4    5     No       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7    Yes       Divorced          220000    No
7    8     No         Single           85000   Yes
8    9     No        Married           75000    No
9   10     No         Single           90000   Yes

In [12]:
print("Binary Attribute: Refund, Cheat")
print("Numerical(Discrete): Tid")
print("Nominal: Marital Status")
print("Numerical(Continuous): Taxable Income")

Binary Attribute: Refund, Cheat
Numerical(Discrete): Tid
Nominal: Marital Status
Numerical(Continuous): Taxable Income

In [27]:
print("Row 3 to 7: ")
print(df[3:8])
print("Row 4 to 8 and column 2 to 4: ")
print(df.iloc[4:9,2:5])
print("All rows with index 1 to 3: ")
print(df.iloc[:,1:4])

Row 3 to 7:
   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120k    No
4    5     No       Divorced            95k   Yes
5    6     No        Married            60k    No
6    7    Yes       Divorced           220k    No
7    8     No         Single            85k   Yes
Row 4 to 8 and column 2 to 4:
  Marital Status Taxable Income Cheat
4       Divorced            95k   Yes
5        Married            60k    No
6       Divorced           220k    No
7         Single            85k   Yes
8        Married            75k    No
All rows with index 1 to 3:
  Refund Marital Status Taxable Income
0    Yes         Single           125k
1     No        Married           100k
2     No         Single            70k
3    Yes        Married           120k
4     No       Divorced            95k
5     No        Married            60k
6    Yes       Divorced           220k
7     No         Single            85k
8     No        Married            75k
9     No         Single            90k

In [35]:
#iris dataset
iris_data = pd.read_csv('Iris.csv')
iris_data.head()

   Id  SepalLength  SepalWidth  PetalLength  PetalWidth        Class
0   1          5.1         3.5          1.4         0.2  Iris-setosa
1   2          4.9         3.0          1.4         0.2  Iris-setosa
2   3          4.7         3.2          1.3         0.2  Iris-setosa
3   4          4.6         3.1          1.5         0.2  Iris-setosa
4   5          5.0         3.6          1.4         0.2  Iris-setosa

In [36]:
print(iris_data.index)

RangeIndex(start=0, stop=150, step=1)

In [37]:
iris_data = iris_data.drop(index=4)
print(iris_data.index)

Index([  0,   1,   2,   3,   5,   6,   7,   8,   9,  10,
       ...
       140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
      dtype='int64', length=149)

In [38]:
iris_data = iris_data.drop(iris_data.columns[3], axis=1)

In [39]:
print(iris_data)

      Id  SepalLength  SepalWidth  PetalWidth           Class
0      1          5.1         3.5         0.2     Iris-setosa
1      2          4.9         3.0         0.2     Iris-setosa
2      3          4.7         3.2         0.2     Iris-setosa
3      4          4.6         3.1         0.2     Iris-setosa
5      6          5.4         3.9         0.4     Iris-setosa
..   ...          ...         ...         ...             ...
145  146          6.7         3.0         2.3  Iris-virginica
146  147          6.3         2.5         1.9  Iris-virginica
147  148          6.5         3.0         2.0  Iris-virginica
148  149          6.2         3.4         2.3  Iris-virginica
149  150          5.9         3.0         1.8  Iris-virginica

[149 rows x 5 columns]

In [41]:
#employees.csv
df = pd.read_csv("employees.csv")
df

,Employee_id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,15-03-2020,Female,5000,4.5
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5

In [42]:
df.shape

(5, 10)

In [43]:
#summary
df.info

<bound method DataFrame.info of    Employee_id     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   15-03-2020  Female   5000     4.5
1   19-07-2017    Male   7000     4.0
2   01-06-2013    Male   6000     3.8
3   10-02-2021  Female   4500     4.7
4   25-11-2010    Male   5000     3.5  >

In [45]:
#stats
df.describe()

,Employee_id,Age,Salary,Years_of_Experience,Bonus,Rating
count,5.000000,5.000000,5.00000,5.000000,5.0,5.000000
mean,103.000000,34.000000,60000.00000,7.400000,5500.0,4.100000
std,1.581139,5.612486,7905.69415,3.847077,1000.0,0.494975
min,101.000000,28.000000,50000.00000,3.000000,4500.0,3.500000
25%,102.000000,29.000000,55000.00000,4.000000,5000.0,3.800000
50%,103.000000,34.000000,60000.00000,8.000000,5000.0,4.000000
75%,104.000000,38.000000,65000.00000,10.000000,6000.0,4.500000
max,105.000000,41.000000,70000.00000,12.000000,7000.0,4.700000

In [46]:
df.head(5)

,Employee_id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,15-03-2020,Female,5000,4.5
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5

In [47]:
df.tail(3)

,Employee_id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5

In [49]:
#Average salary
avg_salary = df['Salary'].mean()

#Total bonus
total_bonus = df['Bonus'].sum()

# Youngest employee's age
youngest_age = df['Age'].min()

# Highest performance rating
highest_rating = df['Rating'].max()

print("Average Salary:", avg_salary)
print("Total Bonus:", total_bonus)
print("Youngest Age:", youngest_age)
print("Highest Rating:", highest_rating)

Average Salary: 60000.0
Total Bonus: 27500
Youngest Age: 28
Highest Rating: 4.7

In [50]:
#sort by salary
df_sorted = df.sort_values(by='Salary', ascending=False)
df_sorted.head()

,Employee_id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7
0,101,Alice,HR,29,50000,4,15-03-2020,Female,5000,4.5

In [52]:
#performance category col added
def categorize_performance(rating):
    if rating >= 4.5:
        return 'Excellent'
    elif rating >= 4.0:
        return 'Good'
    else:
        return 'Average'

df['Performance_Category'] = df['Rating'].apply(categorize_performance)
df.head()

,Employee_id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance_Category
0,101,Alice,HR,29,50000,4,15-03-2020,Female,5000,4.5,Excellent
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0,Good
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8,Average
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7,Excellent
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5,Average

In [53]:
#Finding missing valuse
df.isnull().sum()

Employee_id             0
Name                    0
Department              0
Age                     0
Salary                  0
Years_of_Experience     0
Joining_Date            0
Gender                  0
Bonus                   0
Rating                  0
Performance_Category    0
dtype: int64

In [55]:
# More than 5 years experience
exp_employees = df[df['Years_of_Experience'] > 5]

#Belong to IT department
it_employees = df[df['Department'] == 'IT']

exp_employees, it_employees

(   Employee_id     Name Department  Age  Salary  Years_of_Experience  \
 1          102      Bob         IT   34   70000                    8
 2          103  Charlie         IT   41   65000                   10
 4          105   Edward      Sales   38   60000                   12

   Joining_Date Gender  Bonus  Rating Performance_Category
 1   19-07-2017   Male   7000     4.0                 Good
 2   01-06-2013   Male   6000     3.8              Average
 4   25-11-2010   Male   5000     3.5              Average  ,
    Employee_id     Name Department  Age  Salary  Years_of_Experience  \
 1          102      Bob         IT   34   70000                    8
 2          103  Charlie         IT   41   65000                   10

   Joining_Date Gender  Bonus  Rating Performance_Category
 1   19-07-2017   Male   7000     4.0                 Good
 2   01-06-2013   Male   6000     3.8              Average  )

In [56]:
#Adding Tax column
df['Tax'] = df['Salary'] * 0.10
df.head()

,Employee_id,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance_Category,Tax
0,101,Alice,HR,29,50000,4,15-03-2020,Female,5000,4.5,Excellent,5000.0
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0,Good,7000.0
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8,Average,6500.0
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7,Excellent,5500.0
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5,Average,6000.0

In [57]:
#Saving modified dataset
df.to_csv("modified_employees.csv", index=False)
print("Modified dataset saved successfully")

Modified dataset saved successfully